import * as Yup from "yup";

export const validationSchema = Yup.object().shape({
  name: Yup.string()
    .required("Поля повинні мати значення")
    .min(2, "Поле ім'я має мати принаймні 2 символа")
    .max(40, "Поле ім'я має мати менш ніж 40 символів"),
  lastName: Yup.string()
    .required("Поле прізвище повинно мати значення")
    .min(2, "Поле прізвище має мати принаймні 2 символа")
    .max(40, "Поле прізвище має мати менш ніж 40 символів"),
  age: Yup.number()
    .required("Поле ціна повинно мати значення")
    .min(16, "Мінімальний вік тренера - 16 років")
    .max(80, "Максимальний вік тренера - 80 років"),
  price: Yup.number()
    .required("Поле ціна повинно мати значення")
    .min(0, "Мінімальна ціна має складати 0"),
  email: Yup.string()
    .required("Поле e-mail повинно мати значення")
    .email("В полі email повинна бути валідна адреса електронної пошти"),
  password: Yup.string()
    .required("Поле пароль є обов'язковим")
    .min(6, "Поле пароль мусить містити більше як 6 символів")
    .max(40, "Поле пароль мусить містити менш як 40 символів"),
  submitPassword: Yup.string()
    .required("Поле підтвердження паролю є обов'язковим")
    .oneOf([Yup.ref("password"), null], "Паролі не співпадають"),
  phoneNumber: Yup.string().required(
    "Поле підтвердження паролю є обов'язковим"
  ),
});
